Repository: share-extras/langpack-cy
Catalog: tmx/repository.tmx
Source language: en_us
Languages: cy

source: This condition will match any item added to the space. Use this when you wish to apply an action to everything when it is added to the space.
cy: Bydd yr amod yma yn cydweddu unrhyw eitem a ychwanegir i'r lle. Defnyddiwch hwn pan ydych eisiau cymhwyso gweithred i bob eitem sy'n cael ei ychwanegu i'r lle.

source: Base definitions of all Business Processes
cy: Diffiniadau sail o bob Proses Busness

source: Property value could not be converted to a double: {0}
cy: Methu troi'r gweth priodwedd i ddwbl: {0}

source: Comment
cy: Sylwad

source: Home Folder
cy: Plygell Cartref

source: Fix up invalid uids for people and users; and invalid gids for groups
cy: Trwsio uids annilys ar gyfer pobl a grwpiau; a gids annilys ar gyfer grwpiau

source: Partable
cy: Rhannadwy

source: This will send an email to a list of users when the content matches.
cy: Bydd hwn yn anfon e-bost i restr o ddefnyddwyr pan fo'r cynnwys yn cydweddu.

source: Fixed {0} names ending with a space or full stop. See file {1} for details.
cy: Wedi trwsio {0} enwau yn gorffen gyda bwlch neu atalnod llawn. Gwelwch ffeil {1} am manylion.

source: Installing module ''{0}'' version {1}.
cy: Gosod modiwl "{0}" fersiwn {1}.

source: Performs a link validation check.
cy: Perfformio gwiriad dilysu cysylltiadau.

source: Anonymous constraints can only be declared within the context of a property
cy: Gall cyfyngiadau dienw eu ddatgan mewn cud-destun priodwedd yn unig

source: Remove After
cy: Tynnu ar ôl

source: The rule is applied to all items that are of a specified type or its sub-types
cy: Bydd y rheol yma yn cael ei gweithredu ar pob eitem sydd o math yr un penodol neu ei is-mathau.

source: bytes
cy: beitiau

source: This will add a simple workflow to the matched item. This will allow the item to be moved to a different space for its next step in a workflow. You can also give a space for it to be moved to if you want a reject step.
cy: Bydd hwn yn ychwanegu llif gwaith syml i'r eitem sy'n cydweddu. Bydd y llif gwaith yn galluogi i'r eitem cael ei symud i le gwahanol ar gyfer ei cam nesaf yn y llif gwaith. Cewch hefyd gosod lle i symud o i os ydych eisiau cam gwrthod.

source: Change Guest Person permission from 'Consumer' to 'Read'
cy: Newid caniatâd y Person Gwestai o 'Consumer' i 'Read'

source: Alfresco is starting with errors.
cy: Mae Alfresco yn cychwyn gyda gwallau.

source: Working Copy Owner
cy: Perchennog Copi Gweithio

source: The RSS Templates folder was successfully created: {0}
cy: Wedi creu'r ffolder 'Templedi RSS' yn llwyddiannus: {0}

source: This will copy the matched item to a folder in a web project.
cy: Bydd hwn yn copïo'r eitem sy'n cydweddu i ffolder tu fewn project gwe.

source: A working copy can not be checked out.
cy: Methu gwirio allan copi gweithio.

source: This user is not the owner of the working copy and can not check it in.
cy: Nid yw'r defnyddiwr yn perchennog y copi gweithio a felly ni allir gwirio fo i fewn.

source: The test server ''{0}'' you selected has been allocated to another user, if possible, select a different server and try again.
cy: Mae'r gweinydd profi "{0}" a dewiswyd wedi ei neilltuo i ddefnyddiwr arall. Os bossib, dewiswch gweinydd gwahanol a cheisiwch eto.

source: Start a WCM Workflow
cy: Cychwyn Llif Gwaith WCM

source: No patches were required.
cy: Nid oedd angen unrhyw gywiriadau.

source: Forum Space
cy: Lle Fforwm

source: The rule is applied to all items that have the specified aspect applied.
cy: Bydd y rheol yma yn cael ei gweithredu ar pob eitem gyda'r agwedd penodol wedi gosod.

source: The schema script could not be found at location {0}
cy: Methu canfod y sgript sgema yn y lleoliad {0}

source: Object
cy: Gwrthrych

source: Float
cy: Fflôt

source: UI Design
cy: Cynllun UI

source: Changes storage of aspects on AVM Nodes.
cy: Newid storfa o agweddau ar nodau AVM.

source: The name of the target AVM store.
cy: Enw y stôr AVM targedol.

source: Discussable
cy: Trafodadwy

source: JavaScript files
cy: Ffeiliau JavaScript

source: All Items
cy: Pob Eitem

source: Sets required permissions on 'Saved Searches' folder.
cy: Gosod y caniatadau angenrheidiol ar y ffolder 'Chwiliadau a Chadwyd'.

source: Translations
cy: Cyfieithiadau

source: Export a Space
cy: Allforio Lle

source: The email templates folder already exists: {0}
cy: Mae'r ffolder templedi e-bost yn bodoli eisoes: {0}

source: Bootstraps the node that will hold system registry metadata.
cy: Ychwanegu'r nôd bydd yn dal metadata cofrestrfa system.

source: A module component ''{0}'' failed to execute: {1}
cy: Methwyd gweithredu cydran modiwl "{0}": {1}

source: Link File Path
cy: Llwybr Ffeil Cysylltiad

source: Update avm permissions from 'webfolder' to 'cmobject'.
cy: Newid caniatadau AVM o 'webfolder' i 'cmobject'.

source: Update Repository descriptor
cy: Diweddaru disgrifydd Repositori

source: This will start a workflow for the matched items.
cy: Bydd hwn yn cychwyn llif gwaith i'r eitemau sy'n cydweddu.

source: Copied From
cy: Wedi Copïo o

source: Category Root
cy: Categori Gwreiddiol

source: Replacable
cy: Amnewidadwy

source: Cannot relax mandatory attribute enforcement of property ''{0}
cy: Methu ymlacio gorfodaeth priodoledd angenrheidiol y priodwedd "{0}"

source: Content Package
cy: Pecyn Cynnwys

source: Organization
cy: Sefydliad

source: Alfresco Content Domain Model
cy: Model Parth Cynnwys Alfresco

source: Content Description
cy: Disgrifiad Cynnwys

source: Bypassing schema update checks.
cy: Hepgor gwiriadau uwchraddio sgema.

source: Package Actions
cy: Gweithredion Pecyn

source: Property value could not be converted to a String: {0}
cy: Methu troi'r gweth priodwedd i Linell: {0}

source: Patches cannot be applied to a read-only system. Possible incompatibilities may exist between the application code and the existing data.
cy: Ni allir gosod cywiriadau i system darllen-yn-unig. Efallai bod yna anghytuneddion rhwng y cod cymhwysydd a'r data presennol.

source: Email templates
cy: Templedi e-bost

source: An optional delay to apply to the start of a deployment.
cy: Oediad dewisol i ychwanegu i ddechrae'r darpariaeth.

source: Copy of {0}
cy: Copi o {0}

source: Forum article posted to a topic
cy: Erthygl fforwm sydd wedi ei postio i bwnc

source: Update WCM Content Form folder type.
cy: Diweddaru math folder Ffurflen Cynnwys WCM.

source: Fixed {0} node property serialized values
cy: Wedi trwsio {0} gwerthau priodwedd nôd

source: Alfresco content package for Space ''{0}''.
cy: Pecyn cynnwys Alfresco ar gyfer Lle "{0}".

source: Due Date
cy: Dyddiad Disgwyliedig

source: Remove an aspect from an item
cy: Tynnu agwedd o eitem

source: NodeRef of the deploymentserver to deploy to.
cy: NodeRef o'r gweinydd darpariaeth i ddarparu i.

source: 'Category Root' folder ({0}) could not be found.
cy: Methu canfod y ffolder 'Gwraidd Categori' ({0}).

source: The string encoded list of nodes to revert.
cy: Y rhestr nodau llinyn amgodiwyd i ddychwelyd.

source: Updated {0} icon references
cy: Wedi diweddaru {0} cyfeirnodau eiconau

source: Index recovery terminated.
cy: Adferiad mynegai wedi terfynu

source: Categories within Category Root
cy: Categorïau tu fewn Gwraidd Categori

source: This will transform the matched image and copy the result to a specific space
cy: Bydd hwn yn transffurfio'r delwedd sy'n cydweddu a chopïo'r canlyniad i le penodol

source: The Web Forms folder already exists: {0}
cy: Mae'r ffolder 'Ffurflenni Gwe' yn bodoli eisoes: {0}

source: Import an Alfresco content package
cy: Mewnforio pecyn cynnwys Alfresco

source: Base Content Domain Object
cy: Gwrthrych Cynnwys Parth Sail

source: Task Context
cy: Cud-destun Tasg

source: Constraint ''{0}'' cannot have a 'type' and be a 'reference' attribute
cy: Ni allir cyfyngiad "{0}" cael priodoledd 'math' a fod yn priodoledd 'cyfeiradwy'

source: Presentation Templates
cy: Templedi Cyflwyno

source: Approve Step
cy: Cam Cymeradwyo

source: This reverts a Node to a particular version of that node.
cy: Mae hwn yn dychwelyd nôd i fersiwn dewisiedig o'r nôd yna.

source: Invalid 'minLength' property: {0}
cy: Priodwedd 'minLength' annilys: {0}

source: Property type ''{0}'' of property ''{1}'' is not found
cy: Methu canfod math priodwedd "{0}" o briodwedd "{1}"

source: Directory listing for
cy: Rhestr cyfeiriadur ar gyfer

source: Auditable
cy: Archwiliadwy

source: When this item as last modified
cy: Pan newidiwyd yr eitem yn olaf

source: Name ''{0}'' rewritten to ''{1}''
cy: Enw "{0}" wedi'i ailysgrifennu i ''{1}''

source: Start Date
cy: Dyddiad Cychwyn

source: RSS Templates
cy: Templedi RSS

source: The indexes are not synchronized with the database.
cy: Nid yw'r mynegeion wedi'u cydamseru gyda'r cronfa ddata.

source: No defintion can be found for the property specified so mime type can not be compared.
cy: Methu canfod diffiniad ar gyfer y priodwedd penodol a felly ni ellir cymharu'r math MIME.

source: This will apply a category to the matched item.
cy: Bydd hwn yn gosod categori ar yr eitem sy'n cydweddu.

source: Increment Counter
cy: Cynyddu Cownter

source: Any
cy: Unrhyw

source: Set indirectionVersion on Layered Nodes.
cy: Gosod indirectionVersion ar Nodau Haenol

source: Imports an Alfresco content package into the repository.
cy: Mewnforio pecyn cynnwys Alfresco i'r repositori.

source: Business Process Model
cy: Model Proses Busness

source: Base Content Object
cy: Gwrthrych Cynnwys Sail

source: The Person's middle name
cy: Enw canol y person

source: Configurable
cy: Ffurweddiadwy

source: Execute all rules on the child items.
cy: Gweithredu pob rheol ar yr eitemau plentyn.

source: Categories
cy: Categorïau

source: Index recovery completed.
cy: Adferiad mynegai wedi cwblhau

source: Updated Spaces store root permission from 'Consumer' to 'Read'
cy: Wedi newid caniatâd gwraidd stôr lleoedd o 'Consumer' i 'Read'

source: Set the value of a property
cy: Gosod gwerth priodwedd

source: Optional statement execution failed: SQL: {0} Error: {1} File: {2} Line: {3}
cy: Methwyd gweithredu'r datganiad dewisol: SQL: {0} Gwall: {1} Ffeil: {2} Llinell: {3}

source: Classifiable
cy: Dosbarthiadwy

source: Qualified Name
cy: Enw Cymwysedig

source: Container
cy: Cynhwysydd

source: Aspects were moved.
cy: Symudwyd agweddau.

source: System Folder
cy: Plygell System

source: Workflow Due Date
cy: Dyddiad Disgwyliedig Llif Gwaith

source: This reverts all nodes including and below the argument node to a previous version.
cy: Mae hwn yn dychwelyd pob nôd gan gynnwys ac o dan y nôd ymresymiadol i fersiwn blaenorol.

source: The Person's organization
cy: Sefydliad y person

source: Originator
cy: Cychwynnwr

source: Module ''{0}'' version {1} has the following dependencies: {1}
cy: Mae gan modiwl "{0}" fersiwn y dibyniaethau dilynol: {1}

source: Alfresco Dictionary Model
cy: Model Geiriadur Alfresco

source: Guest Home
cy: Cartref Gwestai

source: Children
cy: Plant

source: Removes the incorrectly applied uifacets aspect from presentation template files.
cy: Tynnu'r agwedd uifacets a gosodwyd yn anghywir o ffeiliau templedi cyflwyniad.

source: The email address ''{0}'' does not reference a valid accessible node.
cy: Nid yw'r cyfeiraid e-bost "{0}" yn cyfeirio at nôd dilys ac hygyrchol.

source: Name
cy: Enw

source: Text
cy: Testun

source: Discussions
cy: Trafodaethau

source: ''{0}'' has been denied access.
cy: Mae "{0}" wedi cael ei gwrthod cychiad.

source: Working Copy
cy: Copi Gweithio

source: Changed {0} 'cm:content' access control entries to 'sys:base'.
cy: Wedi newid {0} cofnod rheoli cyrchu 'cm:content' i 'sys:base'.

source: Applying patch ''{0}'' ({1}).
cy: Gosod cywiriad ''{0}'' ({1}).

source: Multiple nodes found: {0}
cy: Canfodwyd nodau lluosol: {0}

source: No changes were made to the schema.
cy: Dim newidiadau wedi'i gwneud i'r sgema.
